project06/app/controllers/members/games_controller.rb

SELECT * FROM "games" WHERE ("games"."user_id" IS NULL)
---
  def index
    @games = (Game.find_all_by_user_id(current_user.id)).paginate(:page => params[:page], :order => 'created_at DESC')

SELECT * FROM "users"
---
    def load_users
      @users = User.all