project06/app/controllers/members/games_controller.rb

  def index
    @games = Game.paginate(:page => params[:page])
---
SELECT * FROM "games" ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "games"

  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("name", "rating", "created_at", "updated_at", "user_id") VALUES('BigBird', '', '2011-03-07 09:36:41', '2011-03-07 09:36:41', NULL)

  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])
---
SELECT * FROM "games" WHERE ("games"."id" = 4)
UPDATE "games" SET "updated_at" = '2011-03-09 07:15:33', "name" = 'Liz Kingham', "rating" = 'Excellent' WHERE "id" = 4