project06/app/controllers/members/users_controller.rb

SELECT * FROM "users" LIMIT 20 OFFSET 0
---
  def index
    @users = User.paginate(:page => params[:page], :per_page => USERS_PER_PAGE)

UPDATE "users" SET "lastname" = 'Miller', "updated_at" = '2011-03-10 09:40:48', "firstname" = 'Jerel' WHERE "id" = 1
---
  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])