project06/app/controllers/admin/games_controller.rb

  def index
    @games = Game.paginate(:page => params[:page], :order => 'created_at DESC')
---
SELECT * FROM "games" ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "games"

  def my_games
    @games = (Game.find_all_by_user_id(current_user.id)).paginate(:page => params[:page], :per_page => GAMES_PER_PAGE, :order => 'created_at DESC')
    @num_games = Game.count
---
SELECT * FROM "games" WHERE ("games"."user_id" IS NULL)
SELECT count(*) AS count_all FROM "games"

  def create
    @game = Game.new(params[:game])

    if @game.save
---
INSERT INTO "games" ("name", "rating", "created_at", "updated_at", "user_id") VALUES('f', NULL, '2011-03-07 10:40:04', '2011-03-07 10:40:04', NULL)

  def update
    @game = Game.find(params[:id])

    if @game.update_attributes(params[:game])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)
UPDATE "games" SET "updated_at" = '2011-03-07 10:50:57', "name" = 'Her', "rating" = 'Average' WHERE "id" = 5

    def load_users
      @users = User.all
---
SELECT * FROM "users"