project06/app/controllers/admin/my_games_controller.rb

SELECT * FROM "games" WHERE ("games"."user_id" = 1)
---
  def index
    @games = (Game.find_all_by_user_id(current_user.id)).paginate(:page => params[:page], :per_page => GAMES_PER_PAGE, :order => 'created_at DESC')