project06/app/controllers/admin/roles_controller.rb

SELECT * FROM "roles" LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "roles"
---
  def index
    @roles = Role.paginate(:page => params[:page])

SELECT * FROM "roles" WHERE ("roles"."id" = 1)
---
  def edit
    @role = Role.find(params[:id])

INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES('Bad', '2011-03-11 18:30:00', '2011-03-11 18:30:00')
---
  def create
    @role = Role.new(params[:role])

    if @role.save

SELECT * FROM "roles" WHERE ("roles"."id" = 1)
---
  def update
    @role = Role.find(params[:id])

SELECT * FROM "roles" WHERE ("roles"."id" = 1)
DELETE FROM "roles" WHERE "id" = 17
---
  def destroy
    @role = Role.find(params[:id])
    if @role.destroy