project06/app/controllers/admin/users_controller.rb

  def index
    @users = User.paginate(:page => params[:page], :order => 'lastname ASC')
---
SELECT * FROM "users" ORDER BY lastname ASC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "users"

  def update
    @user = User.find(params[:id])
    @user.role = Role.find_by_name(:admin)

    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1
SELECT * FROM "roles" WHERE ("roles"."name" = '--- :admin
UPDATE "users" SET "persistence_token" = '49520a713a1f151cb785fee9494b3c07ba87f92609ffd8031d3e000c3ee38cbc2b9f1bd7b53705bfea58e1f771fb9ff0ec92462e15547b7d22d369db51139e19', "updated_at" = '2011-03-11 04:54:09', "username" = 'whowho', "encrypted_password" = '44de58bddaa749a7818b48e08736ee05759694c7a8f4c572f64b2ab2fe4ca5a1252e39fc6258ecbff6e778687e401e155ed3bea340cacd992cf000c5b051359a', "password_salt" = 'ClEKDGk9Bzj3Bx0VzsB' WHERE "id" = 10

    def load_roles
      @roles = Role.all
---
SELECT * FROM "roles"