project04/app/controllers/articles_controller.rb

SELECT count(*) AS count_all FROM "articles"
---
  def index
    @articles = Article.all
		@total_articles = Article.count