project04/app/controllers/articles_controller.rb

  def edit
		authorize
		@article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)

  def create
    @article = Article.new(params[:article])
		@author = Article.new(params[:author])
		if @author == "Sally"
			redirect_to 'index'
		else
			@article.edits = 0

			respond_to do |format|
				if @article.save
---
INSERT INTO "articles" ("created_at", "title", "author", "body", "updated_at", "edits") VALUES('2011-02-07 10:47:37', 'Once again', 'Trying it', 'I like this. I''m gonna try out all the features again. I am so dang close to getting this thing done. I can''t wait.

  def update
    @article = Article.find(params[:id])
		@article.edits += 1

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)
UPDATE "articles" SET "updated_at" = '2011-02-07 10:22:06', "edits" = 1, "body" = 'A lot of text will be written in here to text out the truncate feature. Gosh I hope it works.

  def destroy
		@valid_user = User.find_by_id(session[:user_id])
		if @valid_user
			@article = Article.find(params[:id])
			@article.destroy
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
DELETE FROM "articles" WHERE "id" = 1