project06/app/controllers/games_controller.rb

SELECT * FROM "games" ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "games"
---
  def index
    @games = Game.paginate(:page => params[:page])

INSERT INTO "games" ("name", "rating", "created_at", "updated_at", "user_id") VALUES('Big', 'Puma', '2011-03-07 00:32:35', '2011-03-07 00:32:35', NULL)
---
  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save

SELECT * FROM "games" WHERE ("games"."id" = 2)
UPDATE "games" SET "updated_at" = '2011-03-07 08:03:10', "rating" = 'Pum' WHERE "id" = 1
---
  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])