project06/app/controllers/users_controller.rb

SELECT * FROM "roles" WHERE ("roles"."name" = 'Member') LIMIT 1
INSERT INTO "users" ("encrypted_password", "created_at", "photo_file_size", "updated_at", "photo_file_name", "username", "role_id", "photo_content_type", "lastname", "password_salt", "photo_updated_at", "persistence_token", "firstname", "email") VALUES('22870cefee9b75ba30753121bc00dc148a9cb05ba4a19729b52a33c6b11d08c6dd28b5f2bb999de16e302cc49786f699fd816def3b96cd28587bad5773830408', '2011-03-09 06:38:25', NULL, '2011-03-09 06:38:25', NULL, 'jjjj', NULL, NULL, 'Jjjj', '0lpOor5hOrjos5Ax36po', NULL, 'ddec6bbd4a766c8a0eb597767d899e7a174579f12a6311ea2244adf75368474000e7e594d831123dd2d54531dad5789cdd1bc4586174da90f08c288ae261adf2', 'Jjjj', 'jjjj@jjjj.com')
---
  def create
    @user = User.new(params[:user])
    @user.role = Role.find_by_name("Member")
    if @user.save