project06/app/controllers/user_sessions_controller.rb

  def create
    @user_session = UserSession.new(params[:user_session])
    @user = User.find_by_username(@user_session.username)
---
SELECT * FROM "users" WHERE (LOWER("users".username) = 'bred') LIMIT 1