project05/app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(:page => params[:page])
---
SELECT * FROM "articles" LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "articles"

  def create
    @article = Article.new(params[:article])

    if @article.save
---
INSERT INTO "articles" ("created_at", "title", "author", "body", "updated_at", "edits") VALUES('2011-02-07 10:47:37', 'Once again', 'Trying it', 'I like this. I''m gonna try out all the features again. I am so dang close to getting this thing done. I can''t wait.

  def update
    @article = Article.find(params[:id])

    if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)
UPDATE "articles" SET "updated_at" = '2011-02-19 04:24:57', "author_id" = 2, "update_count" = 2, "body" = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Morbi non enim eget lacus dignissim sollicitudin vitae id erat. Fusce tortor ligula, lobortis a lobortis ac, cursus non lorem. Quisque non mauris leo. Sed aliquet augue ac orci pretium faucibus. Proin tristique pellentesque ultrices. Praesent convallis, sem et imperdiet fermentum, est dui consectetur metus, id pellentesque est erat nec lectus. Nunc quis dui leo, eu sodales lacus. Suspendisse potenti. Sed egestas sem a ante fringilla consequat. Cras tortor nibh, elementum eu sollicitudin a, bibendum eu dolor. Nullam posuere fermentum nunc, a egestas ipsum accumsan tincidunt.

    def load_authors
      @authors = Author.all
---
SELECT * FROM "authors"