project05/app/controllers/authors_controller.rb

  def index
    @authors = Author.paginate(:page => params[:page])
---
SELECT * FROM "authors" LIMIT 3 OFFSET 0
SELECT count(*) AS count_all FROM "authors"

  def show
    @author = Author.find(params[:id])
    @authors_articles = Article.find_all_by_author_id(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 4)
SELECT * FROM "articles" WHERE ("articles"."author_id" = '1')

  def edit
    @author = Author.find(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 1)

  def create
    @author = Author.new(params[:author])

    if @author.save
---
INSERT INTO "authors" ("name", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "photo_updated_at") VALUES('Pablo', '2011-02-21 07:27:42', NULL, '2011-02-21 07:27:42', NULL, NULL, NULL)

  def update
    @author = Author.find(params[:id])

    if @author.update_attributes(params[:author])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 1)
UPDATE "authors" SET "updated_at" = '2011-02-19 09:19:19', "photo_file_name" = 'logo_realstuff.jpg', "photo_file_size" = 114656, "photo_updated_at" = '2011-02-19 09:19:19', "photo_content_type" = 'image/jpeg' WHERE "id" = 4

  def destroy
    @author = Author.find(params[:id])
    @author.destroy
---
SELECT * FROM "authors" WHERE ("authors"."id" = 6)
DELETE FROM "authors" WHERE "id" = 6